Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/ConsultaFondoPensiones/wsdl/consultaFondoPensionesPS.wsdl

<wsdl:definitions name="consultaFondoPensionesPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaFondoPensionesPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaFondoPensionesPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:aut="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:con="http://www.ficohsa.com.hn/middleware.services/consultaFondoPensionesTypes">


 <wsdl:types>
    <xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
	</xsd:schema>
	<xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaFondoPensionesTypes" schemaLocation="../xsd/consultaFondoPensionesTypes.xsd"/>
	</xsd:schema>
  </wsdl:types>

  	<wsdl:message name="consultaFondoPensionesPSRequest">		
		<wsdl:part name="reqHeader" element="aut:RequestHeader"/>
		<wsdl:part name="inputParameters" element="con:consultaFondoPensionesRequest"/>
	</wsdl:message>
	<wsdl:message name="consultaFondoPensionesPSResponse">		
		<wsdl:part name="rspHeader" element="aut:ResponseHeader"/>
		<wsdl:part name="outputResult" element="con:consultaFondoPensionesResponse"/>
	</wsdl:message>
	
  <wsdl:portType name="consultaFondoPensionesPS">
    <wsdl:operation name="consultaFondoPensiones">
      <wsdl:input message="fic:consultaFondoPensionesPSRequest"/>
      <wsdl:output message="fic:consultaFondoPensionesPSResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  
	<wsdl:binding name="consultaFondoPensionesPSSOAP" type="fic:consultaFondoPensionesPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaFondoPensiones">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaClientePS/consultaFondoPensiones"/>
			<wsdl:input>				
				<soap:header use="literal" part="reqHeader" message="fic:consultaFondoPensionesPSRequest"/>
				<soap:body use="literal" parts="inputParameters"/>
			</wsdl:input>
			<wsdl:output>				
				<soap:header use="literal" part="rspHeader" message="fic:consultaFondoPensionesPSResponse"/>
				<soap:body use="literal" parts="outputResult"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
  
  <wsdl:service name="consultaFondoPensionesPS">
    <wsdl:port binding="fic:consultaFondoPensionesPSSOAP" name="consultaFondoPensionesPSSOAP">
      <soap:address location="http://10.9.104.55:8003/Middleware/ReferenceData/BusinessPartner/ConsultaFondoPensiones"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>